import { type recipeData } from "../types";
import recipesImages from "../images/recipesImages";

const RecipesData: recipeData[] = [
  {
    title: "שקשוקת בשר בקר וחומוס",
    description:
      "  לבשל מראש 120 ג' בשר בקר טחון, לחמם בסיר כף שמן זית ובצל קצוץ, להוסיף את הבשר, 1 עגבניה מגורדת ו- 2/3 כוס גרגירי חומוס ולבשל עד לריכוך. ליצור גומה ברוטב, להוסיף 1 ביצה, לבשל עד למידה הרצויה ולתבל בפלפל שחור וכמון.",
    imgUrl: recipesImages.shakshuka,
  },
  {
    title: "צלי כתף ואנטיפסטי",
    description:
      "לבשל עד לריכוך 120 ג' צלי כתף עם סלרי, כורכום, פלפל שחור וכף שמן זית. לחמם תנור ל-200 מעלות, לחתוך 1 גמבה אדומה, פטריות, 1 גזר, 1 בצל, כוס דלעת וכוס בטטה, לרסס את הירקות במעט שמן זית, לתבל בעשבי תיבול ופלפל שחור ולאפות עד להתרככות.",
    imgUrl: recipesImages.catef,
  },
  {
    title: "דג סלמון וסלט מתוק",
    description:
      "לחמם תנור ל-200 מעלות ולאפות 120 ג' סלמון מתובל בכף שמן זית, עשבי תיבול ופלפל שחור. לחתוך לסלט 2 עלי חסה, חצי כוס גרעיני רימון, 1 תפוח ירוק, סלרי, פטרוזיליה ו-10 יח' קשיו (לא קלוי וללא מלח) ולתבל בפלפל שחור ומעט מיץ מלימון טרי.",
    imgUrl: recipesImages.salomonAndSaled,
  },
  {
    title: "מנת דג ותפוח אדמה אפוי",
    description:
      "לחמם תנור ל-200 מעלות ולאפות עד להתרככות 2 תפוחי אדמה אדומה בינוניים עם כף שמן זית. למרוח 150 ג' דג (אמנון/ בקלה/ דניס/ בס/ טונה) עם מעט מיץ מלימון טרי, כף שמן זית ותבלינים ולאפות לכ-15 דק'.",
    imgUrl: recipesImages.dagBatanur,
  },
  {
    title: "סלט חזה עוף ואבוקדו",
    description:
      "לבשל או לצלות 150 ג' חזה עוף עם כף שמן זית, עשבי תיבול ופלפל שחור, לחתוך את העוף לקוביות ולהוסיף לסלט של 2 עלי חסה, 1 גזר, חצי אבוקדו, עגבניה, מלפפון, בצל ירוק וסלרי קצוץ מתובל בכפית שמן זית, מעט מיץ מלימון טרי ופלפל שחור.",
    imgUrl: recipesImages.ofAndAvokado,
  },
  {
    title: "כריך ביצה ואבוקדו",
    description:
      "למלא לחמניה מקמח מלא עם ביצה קשה וחצי אבוקדו ולחתוך לסלט 1 עגבניה, מלפפון, חסה, פטריות ו-7 חצאי אגוז מלך טבעי.",
    imgUrl: recipesImages.carichAvokado,
  },
  {
    title: "כריך חביתה",
    description:
      "לשמן מחבת עם כף שמן זית ולהוסיף ביצה אחת מקושקשת עם בצל קצוץ ופטרוזיליה. למרוח 14 ג' גבינת שמנת בלחמניה מקמח מלא  ולהוסיף את החביתה, 1 עגבניה וחסה.",
    imgUrl: recipesImages.carichHavita,
  },
  {
    title: "עוף עם אורז",
    description:
      "לבשל או לצלות 150 ג' חזה או 120 ג' כרעיים עוף (ללא עור ועצמות) עם כף שמן זית ותבלינים. לבשל כוס אורז חום ולאדה שעועית ירוקה. לתוספת 18 שקדים (לא קלויים).",
    imgUrl: recipesImages.ofAorez,
  },
  {
    title: "מנת חזה הודו בתוספת תפוח אדמה אפוי",
    description:
      "לבשל או לצלות 140 ג' חזה הודו. לחמם תנור ל-200 מעלות ולאפות עד להתרככות 1 תפוח אדמה אדום בנוני עם כף שמן זית ובצל ירוק קצוץ. להקפיץ חצי כוס עלי תרד עם 2 שיני שום קצוץ וכף שמן זית.",
    imgUrl: recipesImages.hazeHodu,
  },
  {
    title: "קערת בוריטו",
    description:
      "לבשל או לצלות 90 ג' חזה עוף. לבשל כוס אורז חום עם חצי כוס שעועית שחורה או מנומרת. להוסיף את העוף, האורז והשעועית לקערה עם כוס בצל קצוץ, רוטב סלסה עגבניות, רבע כוס קוביות אבוקדו, כוסברה קצוצה ומיץ מפלח ליים.",
    imgUrl: recipesImages.borito,
  },
  {
    title: "סלט פסטה",
    description:
      "לאפות בגריל 85 ג' כרעיים עוף (ללא עור ועצמות). לבשל פסטה ללא גלוטן או פסטה מחיטה מלאה ולסנן. להוסיף את הפסטה לסלט עם חסה, 1 עגבניה, מלפפון וחצי כוס פטריות ולתבל עם כוס רוטב מרינדה, כף שמן זית וכף חומץ בלסמי.",
    imgUrl: recipesImages.pasta,
  },
  {
    title: "המבורגר הודו בתוספת בטטה",
    description:
      "לבשל 120 ג' חזה הודו טחון עם תבלינים, לכדרר ולשטח. להוסיף ללחמניה נטולת גלוטן עם חרדל. לחמם תנור ל-200 מעלות ולאפות עד להתרככות 120 ג' קוביות בטטה מרוססות במעט שמן זית ולפזר קינמון. לחתוך לסלט חסה, 1 עגבניה ובצל סגול קצוץ ולתבל בכף שמן זית וכף חומץ בלסמי.",
    imgUrl: recipesImages.kobiotBatat,
  },
  {
    title: "מנת אורז וקטניות (טבעוני)",
    description:
      "לטגן עם כף שמן זית, בצל קצוץ וגזר מגורד, להוסיף חצי כוס אורז בסמטי מלא וכוס קטניה (חומוס/ שעועית לבנה/ שעועית אדומה/ פולי סויה), מים עד לכיסוי ולבשל עד להתרככות. לתבל בבהרט או בפלפל שחור וכורכום ולהוסיף עשבי תיבול.",
    imgUrl: recipesImages.orezAndHomos,
  },
  {
    title: "מרק כתום בתוספת טופו מוקפץ (טבעוני)",
    description:
      "לטגן עד להשחמה עם כף שמן זית, בצל קצוץ, קוביות גזר, 1 בטטה בנונית חתוכה לקוביות, 100 ג' קוביות דלעת או דלורית ומעט ג'ינג'ר טרי. להוסיף 2/3 כוס עדשים כתומות ומים, לתבל ולבשל. לטחון ולהוסיף כוסברה או פטרוזיליה ומיץ מלימון טרי. להקפיץ במחבת 100 ג' קוביות טופו עם תרסיס שמן זית.",
    imgUrl: recipesImages.marakCatom,
  },
];
export default RecipesData;
// שייקים

// קרם בוטנים
// 240 מ"ל חלב סויה (לא ממותק), 1 בננה, כפית זרעי צ'יה, כף שיבולת שועל, כפית חמאת בוטנים (ללא סוכר), כפית אבקת קקאו (ללא סוכר).
// פירות יער ותרד
// חצי גביע יוגורט צמחי (20 ג' חלבון), 60 מ"ל חלב צמחי (לא ממותק), חצי כוס אוכמניות, 5 תותים וחצי כוס עלי תרד.
// דובדבנים וג'ינג'ר
// חצי גביע יוגורט צמחי (20 ג' חלבון), 200 מ"ל חלב צמחי (לא ממותק), חצי כוס דובדבנים, חצי כפית ג'ינג'ר טחון.
// קיץ
// כוס חלב צמחי (לא ממותק), כוס קוביות מלון או אבטיח או אפרסק, 1 תמר מגולען.
// פירות יער וצ'יה
// כוס חלב צמחי (לא ממותק), חצי כוס פירות יער או אוכמניות, 1 בננה, חופן נבטי חמניה או ברוקולי, כף זרעי צ'יה, כפית חמאת בוטנים (ללא סוכר) או 6 אגוזים מושרים.
// זרעים
// כוס חלב צמחי (לא ממותק), חופן נבטי חמניה, כף זרעי צ'יה, 2 כפות ממרח שקדים או בוטנים (ללא סוכר).
// ירוק
// 1 תפוח, 2 מקלות סלרי, 2 עלי קייל או חסה, 1 מלפפון, כף זרעי צ'יה, כף חמאת בוטנים (ללא סוכר) או 6 אגוזים מושרים.
// פירות יער
// כוס חלב פרה (1% שומן), 1 בננה, כוס פירות יער, כף זרעי פשתן.
// קוקוס ותרד
// כוס חלב קוקוס (לא ממותק), 1 בננה, 1 כוס עלי תרד, 2 כפיות קוקוס טחון.
// תפוז
// כוס חלב שקדים (לא ממותק), 1 בננה, 1 תפוז, 8 שקדים טבעיים.
